{"Humanities & Social Sciences":[{"title":"Anthropology (BA)","code":"UGLA-LAASBBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"Anthropology is the study of humans, past and present. To understand what makes humans unique, and the importance of our differences, anthropology draws on insights from diverse fields, including social and biological sciences and the humanities."},{"title":"Community Advocacy and Social Policy (BA)","code":"UGPP-PPCASPBA","category":"Undergraduate","progcode":"UGPP","shortdesc":"The Bachelor of Arts in Community Advocacy and Social Policy through the School of Social Work is designed to offer you the opportunity to explore issues of diversity, oppression, and privilege and to examine advocacy and intervention strategies to engage in social change."},{"title":"Community Health (BS)","code":"UGNU-NUCHLTBS","category":"Undergraduate","progcode":"UGNU","shortdesc":"The online Bachelor of Science in Community Health at ASU is designed for students who want to create healthy, sustainable communities with an emphasis on working with specific populations."},{"title":"Family & Human Development (BS)","code":"UGLA-LAFASBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The Bachelor of Science in family and human development will equip you with specialized knowledge in human development from infancy through the life span as well as the formation, development, and dissolution of families. "},{"title":"Global Health (BA)","code":"UGLA-LASSHBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Arts degree in global health is an interdisciplinary program designed for those seeking a broad understanding of modern health challenges and their potential solutions. "},{"title":"Global Studies (BA)","code":"UGLA-LASGSBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"Study global issues at one of the top universities in the nation. The Online Bachelors of Arts (BA) in Global Studies, is designed to link theory with global issues and action through policy."},{"title":"Philosophy (BA)","code":"UGLA-LAPHIBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"ASU’s online Bachelor of Arts in Philosophy teaches you how to think well, which in turn lays the foundation for personal and professional success. You will also learn how to structure arguments, write precisely and clearly and communicate ideas in an orderly, persuasive, and unambiguous way."},{"title":"Philosophy (Morality, Politics and Law) (BA)","code":"UGLA-LAPHIMPBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The bachelor of arts in philosophy with a concentration in morality, politics and law combines the basic analytical approaches of philosophy with an emphasis on the moral questions that arise in political theory and law. Students explore the nature of morality, political theory, legal theory and the interconnections between them."},{"title":"Psychology (BA)","code":"UGAS-ASPGSBA","category":"Undergraduate","progcode":"UGAS","shortdesc":"The accredited psychology degree from ASU Online equips students with skills in critical thinking, quantitative and qualitative research, and the ability to interact effectively with groups of people from diverse backgrounds."},{"title":"Psychology (BS)","code":"UGAS-ASPGSBS","category":"Undergraduate","progcode":"UGAS","shortdesc":"The Bachelor of Science in Psychology equips students with skills in critical thinking, quantitative and qualitative research and the ability to interact effectively with groups of people from diverse backgrounds. This degree has an additional focus on math and science coursework."},{"title":"Psychology - Forensic Psychology (BA)","code":"UGAS-ASPGSFPBA","category":"Undergraduate","progcode":"UGAS","shortdesc":"Forensic psychology is the application of psychology to the law. The online Bachelor of Arts in Psychology with a concentration in Forensic Psychology combines general training in psychology with specialized coursework in criminal law, criminal behavior, the diagnosis and treatment of mental disorders and legal decision-making."},{"title":"Psychology - Forensic Psychology (BS)","code":"UGAS-ASPGSFPBS","category":"Undergraduate","progcode":"UGAS","shortdesc":"Crime and mental health is a global issue that is growing rapidly. With ASU’s online Bachelor of Science (BS) in Psychology with a concentration in Forensic Psychology, students will focus on the scientific process between law and psychology."},{"title":"Religious Studies - Religion, Culture and Public Life (BA)","code":"UGLA-LARELCPBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Arts in Religious Studies concentration in Religion, Culture and Public Life focuses on the study of the world’s religious beliefs, traditions, cultures and phenomena across the globe. Students will learn to work with diverse populations, analyze problems from multiple perspectives and find, critically analyze, and to clearly communicate information."},{"title":"Sociology (BS)","code":"UGLA-LASOCBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The Bachelor of Science in Sociology offered online through Arizona State University studies social life, social change and the social causes and consequences of human behavior. As part of the School of Social and Family Dynamics, you will be provided with an excellent liberal arts education that enables you to develop strong research, analytical and critical thinking skills."},{"title":"Women and Gender Studies (BA)","code":"UGLA-LAWSTBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"ASU’s online Bachelor of Arts in Women and Gender Studies empowers you to challenge the conventions of gender and make a difference through academic research, critical knowledge, and a deep understanding in feminist theory and practice."},{"title":"Family & Human Development (MS)","code":"GRLA-LAFAMHDMS","category":"Graduate","progcode":"GRLA","shortdesc":"The Master of Science in Family and Human Development is a 30-credit online degree program offered through the T. Denny Sanford School of Social and Family Dynamics at Arizona State University."},{"title":"Forensic Psychology (MS)","code":"GRAS-ASFPSYMS","category":"Graduate","progcode":"GRAS","shortdesc":"Forensic psychology is the study of how mental health and human behavior intersect with the law and the criminal justice system. This online Master of Science in Forensic Psychology program provides an overview of forensic psychology for students interested in career advancement, additional graduate study, or personal interest."},{"title":"Global Technology & Development (Applied International Development) (MS)","code":"GRFI-FIGTDAIDMS","category":"Graduate","progcode":"GRFI","shortdesc":"The online MS in Global Technology & Development (Applied International Development) allows students to choose an applied area of specialization, including education, business, management, public administration, or health.  It is tailored to one's experience and professional goals in international development; and it is an applied degree, emphasizing the skills and knowledge needed in the field."},{"title":"Global Technology & Development (MS)","code":"GRFI-LSGTDMS","category":"Graduate","progcode":"GRFI","shortdesc":"The Master of Science in global technology & development focuses on international socioeconomic and political change, emphasizing technology and the current processes of globalization."},{"title":"Nonprofit Leadership and Management (MNLM)","code":"GRPP-PPNPSMNS","category":"Graduate","progcode":"GRPP","shortdesc":"The Master of Nonprofit Leadership and Management (MNLM) degree is intended for professionals who work in or desire to work in the nonprofit sector. This online program provides an opportunity to obtain an advanced degree that addresses the unique character of nonprofit organizations and the social sector."},{"title":"Psychology (MS)","code":"GRAS-ASPGSMS","category":"Graduate","progcode":"GRAS","shortdesc":"The MS in Psychology program in the New College of Interdisciplinary Arts & Sciences is home to highly productive researchers who publish in top-tier journals and who have received numerous internal and external funding, as well as awards for career achievements."},{"title":"Sociology (MA)","code":"GRLA-LASOCMA","category":"Graduate","progcode":"GRLA","shortdesc":"The Master of Arts in Sociology is a 30-credit online degree program offered through the T. Denny Sanford School of Social and Family Dynamics at Arizona State University."}],"Business":[{"title":"Applied Leadership (BAS)","code":"UGLS-LSALSBAS","category":"Undergraduate","progcode":"UGLS","shortdesc":"The online Bachelor of Applied Science in Applied Leadership degree shares coursework with the BA in organizational leadership but focuses on applied leadership skills rather than theoretical aspects of leadership. It uses transdisciplinary methods that prepare students to become leaders in a variety of organizations while developing students’ skills and knowledge."},{"title":"Business - Business Administration (BA)","code":"UGBA-BABUSBABA","category":"Undergraduate","progcode":"UGBA","shortdesc":"The Bachelor of Arts in business with a concentration in business administration provides a breadth of knowledge and skills needed for managing business operations. These skills include forecasting demand, planning inventory, purchasing services, conducting skillful negotiations, building strategies for the future and managing people, finances and risk."},{"title":"Business - Communication (BA)","code":"UGBA-BABUSCBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"ASU's Bachelor of Arts in business with a concentration in communication will prepare you to understand and shape message-related behaviors for the purpose of improving communicative interactions in the workplace."},{"title":"Business - Corporate Accounting (BA)","code":"UGBA-BABUSCABA","category":"Undergraduate","progcode":"UGBA","shortdesc":"The online Bachelor of Arts in Business with a concentration in Corporate Accounting is structured to prepare students for careers in management accounting.  Career opportunities in this field are generally substantive and in high demand."},{"title":"Business - Food Industry Management (BA)","code":"UGBA-BABUSFIMBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"ASU's online Bachelor of Arts in business with a concentration in food industry management will prepare you for business careers in the processing, marketing and distribution of food beyond the farm to retail stores, restaurants and institutions."},{"title":"Business - Global Leadership (BA)","code":"UGBA-BABUSGBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"Offered through ASU’s W. P. Carey School of Business, the online BA in business with a concentration in global leadership will prepare you for related careers by developing strong global business skills and focusing on global studies courses from regions around the world."},{"title":"Business - Global Logistics Management (BA)","code":"UGBA-BABUSGLBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"Offered through the W. P. Carey School of Business, ASU’s BA in business with a concentration in global logistics management provides the needed skills to develop strategic business processes for logistics management and an understanding of their relationship to the global distribution of goods and services."},{"title":"Business - Retail Management (BA)","code":"UGBA-BABUSRBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"ASU’s online Bachelor of Arts in business with a concentration in retail management focuses on the knowledge and skills necessary for leadership roles within the retail industry. Offered through The W. P. Carey School of Business, this degree provides the full business core plus a concentration with retail-specific coursework."},{"title":"Business - Sustainability (BA)","code":"UGBA-BABUSSBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"ASU’s online Bachelor of Arts in business with a concentration in sustainability will provide you with the skills to help create an improved social and environmental quality of life for future generations."},{"title":"Business - Tourism (BA)","code":"UGBA-BABUSTBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"The Bachelor of Arts in business with a concentration in tourism is an innovative, interdisciplinary program intended to prepare students for positions in a variety of professions in which business and tourism play an important role in ensuring success."},{"title":"Business Data Analytics (BS)","code":"UGBA-BABDABS","category":"Undergraduate","progcode":"UGBA","shortdesc":"The Bachelor of Science in business data analytics prepares business students with the requisite knowledge, skills and experience to create and manage big data initiatives as well as associated business processes to facilitate large-scale business data analytics in organizations."},{"title":"Computer Information Systems (BS)","code":"UGBA-BACISBS","category":"Undergraduate","progcode":"UGBA","shortdesc":"You will find your future with Computer Information Systems is limitless. The online W. P. Carey degree in computer information systems delivers the tools you need to meet rising demand for experts in systems analysis, business applications programming, web and mobile development, business database design, and decision support across public, private, nonprofit, and government entities worldwide."},{"title":"Digital Audiences (BS)","code":"UGCS-CSDIGABS","category":"Undergraduate","progcode":"UGCS","shortdesc":"The online Bachelor of Science in Digital Audiences gives students the skills they need to use digital and social media to deepen impact in any industry, including strategy development, digital analytics, SEO and SEM campaigns, paid and organic social campaigns, audience research and more."},{"title":"Economics (BS) - Business","code":"UGBA-BAECNBS","category":"Undergraduate","progcode":"UGBA","shortdesc":"The online Bachelor of Science in Economics pairs a solid business curriculum with rigorous theoretical and empirical tools to study the decisions of individuals, firms and governments."},{"title":"Economics (BS) - Liberal Arts","code":"UGLA-LAECNBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The ASU Online Bachelor of Science in Economics provides students with a set of rigorous theoretical and empirical tools to study the decisions of individuals, firms and governments. The economics curriculum can be paired with a customized set of electives to suit individual interest."},{"title":"Management (BS)","code":"UGBA-BAMGTBS","category":"Undergraduate","progcode":"UGBA","shortdesc":"The Bachelor of Science in management prepares students to become effective managers and team leaders by building theoretical and conceptual knowledge and critical skills."},{"title":"Marketing (BS)","code":"UGBA-BAMKTBS","category":"Undergraduate","progcode":"UGBA","shortdesc":"The Bachelor of Science in marketing prepares students to steer organizations in the right direction, with fundamental marketing knowledge and skills in market analysis, decision-making and communication."},{"title":"Operations Management (Applied Science BAS)","code":"UGES-TSIMCOBAS","category":"Undergraduate","progcode":"UGES","shortdesc":"The Bachelor of Applied Sciences with a concentration in operations management technology, offered online through ASU’s Ira A. Fulton Schools of Engineering, will provide you with the tools needed for success as a manager, including organization, motivation and hiring skills, as well as resource development."},{"title":"Organizational Leadership (BA)","code":"UGLS-LSORGLBA","category":"Undergraduate","progcode":"UGLS","shortdesc":"The Bachelor of Arts in organizational leadership will prepare you for leadership positions in a wide range of organizations and career fields. You will develop skills that can be used to help organizations function successfully, including problem solving, effective communication, program assessment, resource management and how to use emerging technologies."},{"title":"Biomimicry (MS)","code":"GRLA-LABMYMS","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Science in Biomimicry at ASU is a first of its kind program focusing on an emerging discipline that seeks to apply life’s strategies to human design. Offered in collaboration with Biomimicry 3.8 through The Biomimicry Center at ASU, the MS also complements the Certified Biomimicry Professional program offered by Biomimicry 3.8. "},{"title":"Business Analytics (MS)","code":"GRBA-BABUSANMS","category":"Graduate","progcode":"GRBA","shortdesc":"The W. P. Carey Master of Science in Business Analytics (MS‑BA) degree at Arizona State University develops the tools you need for a growing career field, while giving you the flexibility to learn on your schedule. Delivered entirely online, you’ll discover how to derive value from data, lead data-driven analyses, and create a business advantage across markets and industries."},{"title":"Business Journalism (MS)","code":"GRCS-CSBSJMS","category":"Graduate","progcode":"GRCS","shortdesc":"The Master of Science in Business Journalism at Arizona State University is a 100% online degree program geared toward journalists and communications professionals who want to develop expertise in business and in communicating about business, economics and finance in order to more effectively serve audiences."},{"title":"Digital Audience Strategy (MS)","code":"GRCS-CSDASMS","category":"Graduate","progcode":"GRCS","shortdesc":"The online Master of Science in Digital Audience Strategy prepares students to design and execute large-scale digital audience strategy through a data-driven, multidisciplinary, hands-on curriculum. Students learn to measure and analyze how consumers interact with content online, on social media and on mobile devices."},{"title":"Executive Master of Public Administration (EMPA)","code":"GRPP-PPPUAEMPA","category":"Graduate","progcode":"GRPP","shortdesc":"Ranked nationally in the top 5% by US News & World Report, the ASU School of Public Affairs is launching an Executive Master of Public Administration (EMPA) degree in collaboration with the McCain Institute for International Leadership. The EMPA program is designed to develop an executive leaders’ capacity for effective decision-making."},{"title":"Information Management (MS)","code":"GRBA-BAINFOMS","category":"Graduate","progcode":"GRBA","shortdesc":"The highly ranked W. P. Carey Master of Science in Information Management (MSIM) is designed to supply you with business skills needed to leverage IT knowledge and gain a competitive advantage in the global economy. This 16-month online degree program is designed for IT professionals with at least two years of work experience and who are planning to work full-time while attending school."},{"title":"Leadership and Management (MALM) - Thunderbird","code":"GRTB-TBALMMALM","category":"Graduate","progcode":"GRTB","shortdesc":"The Online Master of Applied Leadership & Management is not just a master's degree from a top ranked school of global management, it is specially designed to take your career to the next level. Globalize your leadership skills in a flexible online format designed for working professionals and become part of the prestigious Thunderbird Alumni Network."},{"title":"MBA - Master of Business Administration","code":"GRBA-BAONLINMBA","category":"Graduate","progcode":"GRBA","shortdesc":"The W. P. Carey Online MBA is designed to provide the ability to obtain a master's degree from an AACSB-accredited, top-30 business school no matter where you live. Focused and flexible, the highly ranked program delivers the knowledge and skills you need to advance your career, whether you travel for work or simply prefer learning whenever and wherever it’s convenient for you."},{"title":"MBA/MS - Industrial Engineering","code":"GRES-ESINDENMS,BAONLINMBA","category":"Graduate","progcode":"GRES","shortdesc":"The MBA/Engineering concurrent degree program at Arizona State University combines advanced courses in technical areas with a rigorous management curriculum. The MBA/MS in Industrial Engineering is designed for working professionals who need to stay current in their area of expertise and develop enhanced business acumen."},{"title":"MBA/MSE - Electrical Engineering","code":"GRES-ESEEMSE,BAONLINMBA","category":"Graduate","progcode":"GRES","shortdesc":"The MBA/Engineering concurrent degree program at Arizona State University combines advanced courses in technical areas with a rigorous management curriculum. The MBA/MSE in Electrical Engineering is designed for working professionals who need to stay current in their area of expertise and develop enhanced business acumen."},{"title":"Nonprofit Leadership and Management (MNLM)","code":"GRPP-PPNPSMNS","category":"Graduate","progcode":"GRPP","shortdesc":"The Master of Nonprofit Leadership and Management (MNLM) degree is intended for professionals who work in or desire to work in the nonprofit sector. This online program provides an opportunity to obtain an advanced degree that addresses the unique character of nonprofit organizations and the social sector."},{"title":"Sustainability Leadership (MSL)","code":"GRSU-SUSUSLMSL","category":"Graduate","progcode":"GRSU","shortdesc":"The Master of Sustainability Leadership (MSL) prepares professionals to advance social and environmental responsibility. The program teaches organizational leadership skills through the lens of sustainability. MSL equips graduates to drive high-impact global sustainability results for their companies, organizations and communities."},{"title":"Advanced Analytics in Higher Education (Graduate Certificate)","code":"GRND-TEAAHEGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The graduate certificate in Advanced Analytics in Higher Education at ASU Online prepares professionals to conduct advanced analytics and assist university personnel in making data-driven decisions for higher and postsecondary education. "},{"title":"Applied Business Data Analytics (Undergraduate Certificate)","code":"UGNFA-BABDACERT","category":"Certificates","progcode":"UGNFA","shortdesc":"The online undergraduate certificate in Applied Business Data Analytics prepares non-business students for modern data-driven, evidence-based decision making processes. "},{"title":"Biomimicry (Graduate Certificate)","code":"GRND-LABMYGRCT","category":"Certificates","progcode":"GRND","shortdesc":"Are you a change-agent passionate about learning from the world of biology and its applications to human design?\n "},{"title":"Digital Audience Strategy (Graduate Certificate)","code":"GRND-CSDASGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Graduate Certificate in Digital Audiences prepares students to execute digital audience strategy in any industry. Students learn to measure and analyze how consumers interact with content online, on social media and on mobile devices. This program is designed for professionals who want to develop new skills, take on new responsibilities or more effectively promote their work."},{"title":"Lean Six Sigma Black Belt (Graduate Certificate)","code":"GRND-ESLSSBGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Lean Six Sigma Black Belt graduate certificate is aimed at engineers and managers who oversee tactical and strategic projects as well as various operational functions in their organizations."},{"title":"Social Entrepreneurship and Community Development (Graduate Certificate)","code":"GRND-PPSECDGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The social entrepreneurship and community development certificate offered online through ASU provides a framework for harnessing social entrepreneurial and enterprise opportunities and creating transformative responses to challenges prevalent in societies and communities."}],"Art & Design":[{"title":"Art (Digital Photography) (BFA)","code":"UGHI-HIARTDPBFA","category":"Undergraduate","progcode":"UGHI","shortdesc":"The Bachelor of Fine Arts in Art in Digital Photography at ASU is the first online program from a research 1 university or fine art college in the nation to offer a studio practice-based degree. Working with a faculty of professional artists, students have the opportunity to master technical, aesthetic and conceptual aspects of digital photography."},{"title":"Art History (BA)","code":"UGHI-FAARTHBA","category":"Undergraduate","progcode":"UGHI","shortdesc":"The Bachelor of Arts in art history through ASU’s Herberger Institute for Design and the Arts is one of few online art history programs offered nationwide. The ASU Online Art History BA is a comprehensive degree designed to engage you with visuality in a variety of ways. The program provides a high-quality art history education and will prepare you for a life-long career. "},{"title":"Film & Media Studies (BA)","code":"UGLA-LAFMSBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The Bachelor of Arts in film and media studies will provide you with the skills to succeed in the entertainment industry, including film, television and new media, as well as local arts organizations. "},{"title":"Graphic Information Technology (BS)","code":"UGES-TSGITBS","category":"Undergraduate","progcode":"UGES","shortdesc":"The online Bachelor of Science in graphic information technology provides students with a creative, technological, and managerial understanding of graphic information and content creation. The program lives at the intersections of creativity, visual design and technology, preparing students to create visual content for multi-channel distribution – print, web, photo, video, animation."},{"title":"American Media and Popular Culture (MAS)","code":"GRLA-LAAMPCMAS","category":"Graduate","progcode":"GRLA","shortdesc":"The MAS in American Media and Popular Culture will equip students with the analytical, creative and communication skills to become critical consumers, creative professionals, and rigorous scholars of film, television, and digital media. The program consists of nine credit hours of core courses, 21 credit hours of electives and a comprehensive exam."},{"title":"Biomimicry (MS)","code":"GRLA-LABMYMS","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Science in Biomimicry at ASU is a first of its kind program focusing on an emerging discipline that seeks to apply life’s strategies to human design. Offered in collaboration with Biomimicry 3.8 through The Biomimicry Center at ASU, the MS also complements the Certified Biomimicry Professional program offered by Biomimicry 3.8. "},{"title":"Graphic Information Technology (MSTech)","code":"GRES-TSGIMSTECH","category":"Graduate","progcode":"GRES","shortdesc":"Arizona State University's Master of Science in graphic information technology targets graphics professionals, supervisors and managers in a graphics or technology-oriented area who need advanced expertise in administering and managing digital content."},{"title":"Biomimicry (Graduate Certificate)","code":"GRND-LABMYGRCT","category":"Certificates","progcode":"GRND","shortdesc":"Are you a change-agent passionate about learning from the world of biology and its applications to human design?\n "}],"History":[{"title":"Art History (BA)","code":"UGHI-FAARTHBA","category":"Undergraduate","progcode":"UGHI","shortdesc":"The Bachelor of Arts in art history through ASU’s Herberger Institute for Design and the Arts is one of few online art history programs offered nationwide. The ASU Online Art History BA is a comprehensive degree designed to engage you with visuality in a variety of ways. The program provides a high-quality art history education and will prepare you for a life-long career. "},{"title":"History (BA)","code":"UGLA-LAHISBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The Bachelor of Arts in history is an interdisciplinary degree designed to give you an understanding of the development of human society and the political, social, economic, and cultural dynamics that influence today’s complex world. "},{"title":"History (MA)","code":"GRLA-LAHISTMA","category":"Graduate","progcode":"GRLA","shortdesc":"ASU’s online master of arts degree in history offers dynamic content along with valuable skills. The degree deepens your knowledge of history while developing core skills applicable in a variety of settings. Students graduate from the program with an enhanced ability in finding and analyzing information, planning and organizing projects, and writing and speaking effectively."},{"title":"World War II Studies (MA)","code":"GRLA-LAWWSMA","category":"Graduate","progcode":"GRLA","shortdesc":"Built through a unique partnership between ASU and The National WWII Museum (NWWM) in New Orleans, this fully-online, interdisciplinary World War II Studies graduate degree is the first of its kind in the nation."}],"Health & Nutrition":[{"title":"Biochemistry (BS)","code":"UGLA-LABCHBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Science in Biochemistry provides students with a course of study in the chemical processes of living organisms. This online program is appropriate preparation for further study of biochemistry or related sciences in graduate school and for medical, dental or pharmacy school."},{"title":"Biological Sciences (BS)","code":"UGLA-LABSCBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Science in Biological Sciences degree enables students to delve into the basic organization and processes of life (microbes, plants and animals) at scales ranging from molecules to ecosystems and in time from picoseconds to millennia."},{"title":"Community Health (BS)","code":"UGNU-NUCHLTBS","category":"Undergraduate","progcode":"UGNU","shortdesc":"The online Bachelor of Science in Community Health at ASU is designed for students who want to create healthy, sustainable communities with an emphasis on working with specific populations."},{"title":"Global Health (BA)","code":"UGLA-LASSHBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Arts degree in global health is an interdisciplinary program designed for those seeking a broad understanding of modern health challenges and their potential solutions. "},{"title":"Health Care Coordination (BS)","code":"UGNU-NUHCCOBS","category":"Undergraduate","progcode":"UGNU","shortdesc":"The online Bachelor of Science in Health Care Coordination prepares students to effectively coordinate resources to optimize individual health outcomes. Changes in the health care system place greater emphasis and financial incentives on preventing disease and maintaining healthy lifestyles. This has increased demand for care coordination services to assist individuals and their support teams."},{"title":"Health Education and Health Promotion (BS)","code":"UGNH-NHHEHPBS","category":"Undergraduate","progcode":"UGNH","shortdesc":"The B.S. in Health Education and Health Promotion, offered through ASU's School of Nutrition & Health Promotion, is designed for students interested in preparing to become a Certified Health Education Specialist (CHES). The CHES® designation signifies that an individual has met required academic preparation qualifications and has successfully passed the competency-based examination."},{"title":"Health Entrepreneurship and Innovation (BAS)","code":"UGNU-NUHCIBAS","category":"Undergraduate","progcode":"UGNU","shortdesc":"The Bachelor of Applied Science in Health Entrepreneurship and Innovation helps students achieve leadership roles in the innovative health care industry."},{"title":"Health Entrepreneurship and Innovation (BS)","code":"UGNU-NUHCIBS","category":"Undergraduate","progcode":"UGNU","shortdesc":"The bachelor of science in health entrepreneurship and innovation program prepares students to lead and navigate inevitable changes in health care related to technology, policy, communication and leadership."},{"title":"Health Sciences (BAS)","code":"UGNH-NUHSCBAS","category":"Undergraduate","progcode":"UGNH","shortdesc":"The online BAS in health sciences degree at Arizona State University is ideal for people in health-related fields who have an associate of applied science (AAS) degree and want to earn their four-year degree. "},{"title":"Healthy Lifestyles Coaching (Health Sciences) (BS)","code":"UGNH-NUHSCHLCBS","category":"Undergraduate","progcode":"UGNH","shortdesc":"The healthy lifestyles coaching focus combines exercise and wellness, nutrition, and health sciences to provide you with a solid background in preventative health care. "},{"title":"Integrative Health (BS)","code":"UGNU-NUIHLTBS","category":"Undergraduate","progcode":"UGNU","shortdesc":"The online Bachelor of Science in Integrative Health at ASU provides a foundation in integrative health, a holistic approach to wellness that focuses on the mind, body, and spirit.  The program is based on research and evidence-based subject matter, as well as ethical, legal, and cultural foundations of integrative health care."},{"title":"International Public Health (BIPH)","code":"UGNH-NHIPHBIPH","category":"Undergraduate","progcode":"UGNH","shortdesc":"Gain invaluable experience and insight into global health issues with the online Bachelor of International Public Health (BIPH) degree program, which leverages international expertise of three leading universities, ASU, UNSW Sydney and King’s College London. This tri-university global health program is essential  to prepare for a career in international public health."},{"title":"Nursing - RN to BSN","code":"UGNU-NUNURDBSN-NURRNBSN","category":"Undergraduate","progcode":"UGNU","shortdesc":"ASU's RN to BSN prepares you as a nursing professional for the multi-faceted demands of the changing healthcare landscape through an innovative, online curriculum."},{"title":"Nutrition (BS)","code":"UGNH-NHNTRBS","category":"Undergraduate","progcode":"UGNH","shortdesc":"Arizona State University's online bachelor of science in nutrition prepares students for careers in food production, service management, marketing and journalism around health and wellness topics."},{"title":"Speech and Hearing Science (BS)","code":"UGNH-LASHSBS","category":"Undergraduate","progcode":"UGNH","shortdesc":"The online Bachelor of Science in Speech and Hearing Science prepares students to pursue graduate study in speech-language pathology or audiology. Students will focus on normal speech, language, and hearing processes across the lifespan, with an increased focus on communication disorders in upper-division coursework."},{"title":"Behavioral Health (Clinical) (DBH)","code":"GRNH-NHBVHCDBH","category":"Graduate","progcode":"GRNH","shortdesc":"The Doctor of Behavioral Health program offered through the College of Health Solutions prepares you, as master’s–level clinicians, for the newly transformed medical care marketplace, one in which evidence–based, cost–effective behavioral interventions replace treatment that results in undercare, overcare, or misuse."},{"title":"Behavioral Health (Management) (DBH)","code":"GRNH-NHBVHMDBH","category":"Graduate","progcode":"GRNH","shortdesc":"The Doctor of Behavioral Health program with an emphasis in management through the College of Health Solutions, prepares current and future healthcare managers for the newly transformed medical care marketplace, one in which evidence–based, cost–effective behavioral interventions replace treatment that results in undercare, overcare, or misuse."},{"title":"Biomedical Diagnostics (MS)","code":"GRNH-NHBMDMS","category":"Graduate","progcode":"GRNH","shortdesc":"The Master of Science in Biomedical Diagnostics is offered through the International School of Biomedical Diagnostics. ASU, along with our academic partner Dublin City University (DCU) and other industry partners, is creating a critical center of biomedical knowledge and innovation, committed to stimulating economic growth and improving the quality of life globally."},{"title":"Biomimicry (MS)","code":"GRLA-LABMYMS","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Science in Biomimicry at ASU is a first of its kind program focusing on an emerging discipline that seeks to apply life’s strategies to human design. Offered in collaboration with Biomimicry 3.8 through The Biomimicry Center at ASU, the MS also complements the Certified Biomimicry Professional program offered by Biomimicry 3.8. "},{"title":"Clinical Research Management (MS)","code":"GRNU-NUCRMMS","category":"Graduate","progcode":"GRNU","shortdesc":"ASU's Master of Science in clinical research management advances your nursing and health care career, providing skills for a career in the diverse and complex field of clinical research management. "},{"title":"Clinical Research Management - Regulatory Science (MS)","code":"GRNU-NUCRMRSMS","category":"Graduate","progcode":"GRNU","shortdesc":"With the role of clinical research managers expanding, ASU’s online MS in clinical research management, regulatory science specialty, takes a transdisciplinary approach in providing an education strong in commercial and fiscal practices of conducting clinical research, ethical and regulatory aspects of research, and management of clinical drug, biological, and medical device trials."},{"title":"Health Informatics (MAS)","code":"GRNH-GCHLHINMAS","category":"Graduate","progcode":"GRNH","shortdesc":"ASU’s Master of Advanced Study in Health Informatics, offered online through the Department of Biomedical Informatics, provides an innovative approach to combine information technology, computer science and knowledge management to improve health."},{"title":"Healthcare Innovation (MHI)","code":"GRNU-NUHCINNMHI","category":"Graduate","progcode":"GRNU","shortdesc":"The online master of healthcare innovation degree at ASU offers a multidisciplinary, educational approach to prepare students for an innovative and transformative role in healthcare. Students will learn change theory, leadership, entrepreneurship, application technology, and system design programs, to create innovative and transformative solutions to current healthcare challenges."},{"title":"International Health Management (MIHM)","code":"GRNH-NHIHMIHM","category":"Graduate","progcode":"GRNH","shortdesc":"The Master of International Health Management degree is offered by Arizona State University in partnership with the University of New South Wales in Sydney, Australia. It is a fully integrated 100% online program taught across both the privatized and public health care systems – ideal for those seeking a career in international health systems management."},{"title":"Medical Nutrition (MS)","code":"GRNH-NHMNTRMS","category":"Graduate","progcode":"GRNH","shortdesc":"The online MS in Medical Nutrition is designed for future and current healthcare professionals, including gap year students (those who have completed their BS degree but have not yet secured admission to a medical school) and current medical students, residents, fellows, and practitioners seeking to develop a strong knowledge base in the nutritional sciences and its application in healthcare."},{"title":"Nutrition (Dietetics) (MS)","code":"GRNH-ECNTRDMS","category":"Graduate","progcode":"GRNH","shortdesc":"The online MS in Nutrition (Dietetics) is based on scientific foundations of nutrition and reinforces essential skills in project management, interpretation of research literature, critical inquiry and problem-solving. Offered by ASU’s School of Nutrition and Health Promotion, this non-thesis program is available only to registered dietitians with at least one year of experience."},{"title":"Science of Health Care Delivery (MS)","code":"GRNH-NHSHCDMS","category":"Graduate","progcode":"GRNH","shortdesc":"The School for the Science of Health Care Delivery prepares current and future administrative and clinical health care professionals to address the complex needs of the health care system. Through the interdisciplinary study of population health, patient-centered care, health economics, policy, data analytics and leadership, students gain the skills necessary to achieve value-based health care."},{"title":"Biomimicry (Graduate Certificate)","code":"GRND-LABMYGRCT","category":"Certificates","progcode":"GRND","shortdesc":"Are you a change-agent passionate about learning from the world of biology and its applications to human design?\n "},{"title":"Clinical Research Management (Graduate Certificate)","code":"GRND-NUHCRGRCC","category":"Certificates","progcode":"GRND","shortdesc":"The graduate certificate in Clinical Research Management addresses the needs of health care professionals who want to work in the diversified and complex clinical research industry. This flexible 15-credit online program is designed for nurses, physicians and other professionals within the field of health care. "},{"title":"Health Care Innovation (Graduate Certificate)","code":"GRND-NUHCINGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online healthcare innovation graduate certificate at Arizona State University will provide you with the cognitive and affective competencies to create and sustain transformative change in health care."},{"title":"Integrated Behavioral Health - Clinical (Grad Certificate)","code":"GRNH-NHIBHCGRCT","category":"Certificates","progcode":"GRNH","shortdesc":"The online graduate certificate in Integrated Behavioral Health - Clinical is intended to provide master's level behavioral clinicians with skills necessary to successfully transition into the integrated primary care environment."},{"title":"Integrated Behavioral Health - Management (Grad Certificate)","code":"GRNH-NHIBHMGRCT","category":"Certificates","progcode":"GRNH","shortdesc":"Students of the online Integrated Behavioral Health - Management Graduate Certificate will receive training on effective management of integrated care systems. Explore new skills from mental health treatment, enhanced behavior change coaching, strategic planning on health outcome improvements and overall quality of care."},{"title":"Science of Health Care Delivery (Graduate Certificate)","code":"GRND-NHHCDGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The graduate certificate in the Science of Health Care Delivery at ASU Online prepares the future and current workforce with the fundamental knowledge and skills to lead change in all levels of the healthcare system. The Science of Health Care Delivery curriculum aligns with the Triple Aim: Improve patient outcomes, improve population health, and lower health care costs."}],"Natural Sciences":[{"title":"Biochemistry (BS)","code":"UGLA-LABCHBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Science in Biochemistry provides students with a course of study in the chemical processes of living organisms. This online program is appropriate preparation for further study of biochemistry or related sciences in graduate school and for medical, dental or pharmacy school."},{"title":"Biological Sciences (BS)","code":"UGLA-LABSCBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Science in Biological Sciences degree enables students to delve into the basic organization and processes of life (microbes, plants and animals) at scales ranging from molecules to ecosystems and in time from picoseconds to millennia."}],"Communication":[{"title":"Business - Communication (BA)","code":"UGBA-BABUSCBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"ASU's Bachelor of Arts in business with a concentration in communication will prepare you to understand and shape message-related behaviors for the purpose of improving communicative interactions in the workplace."},{"title":"Communication (BS)","code":"UGLA-LACOMBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The Bachelor of Science in communication program will teach you how communication processes create, maintain, and transform identities, workplaces, and communities. "},{"title":"Digital Audiences (BS)","code":"UGCS-CSDIGABS","category":"Undergraduate","progcode":"UGCS","shortdesc":"The online Bachelor of Science in Digital Audiences gives students the skills they need to use digital and social media to deepen impact in any industry, including strategy development, digital analytics, SEO and SEM campaigns, paid and organic social campaigns, audience research and more."},{"title":"Marketing (BS)","code":"UGBA-BAMKTBS","category":"Undergraduate","progcode":"UGBA","shortdesc":"The Bachelor of Science in marketing prepares students to steer organizations in the right direction, with fundamental marketing knowledge and skills in market analysis, decision-making and communication."},{"title":"Mass Communication and Media Studies (BA)","code":"UGCS-CSMCMSTBA","category":"Undergraduate","progcode":"UGCS","shortdesc":"The Bachelor of Arts in Mass Communication and Media Studies at Arizona State University's Walter Cronkite School of Journalism and Mass Communication, one of the nation’s premier journalism schools, explores global mass communication issues from all dimensions: societal, cultural, historical, political, economic, technological and legal."},{"title":"Technical Communication (BS)","code":"UGLS-LSTECBS","category":"Undergraduate","progcode":"UGLS","shortdesc":"Through Arizona State University's online Bachelor of Science in Technical Communication, you will learn how to produce, design and manage information, using both traditional and developing technologies. Technical communication is applied workplace communication that makes technical information understandable and available to many audiences."},{"title":"Technical Communication - User Experience (BS)","code":"UGLS-LSTECUBS","category":"Undergraduate","progcode":"UGLS","shortdesc":"The online interdisciplinary user experience (UX) concentration provides technical communication majors with a conceptual understanding and applied skills in gathering user information, analyzing data, and communicating research findings to stakeholders."},{"title":"Business Journalism (MS)","code":"GRCS-CSBSJMS","category":"Graduate","progcode":"GRCS","shortdesc":"The Master of Science in Business Journalism at Arizona State University is a 100% online degree program geared toward journalists and communications professionals who want to develop expertise in business and in communicating about business, economics and finance in order to more effectively serve audiences."},{"title":"Communication (MA)","code":"GRLA-LACOMMOMA","category":"Graduate","progcode":"GRLA","shortdesc":"The Communication (MA) is designed for business and nonprofit professionals who want to improve the leadership, strategic planning, and communication skills that will allow them to advance in their current careers or to succeed in a new one. The degree employs an innovative program design that accesses collaboration among award winning Hugh Downs School of Human Communication faculty."},{"title":"Digital Audience Strategy (MS)","code":"GRCS-CSDASMS","category":"Graduate","progcode":"GRCS","shortdesc":"The online Master of Science in Digital Audience Strategy prepares students to design and execute large-scale digital audience strategy through a data-driven, multidisciplinary, hands-on curriculum. Students learn to measure and analyze how consumers interact with content online, on social media and on mobile devices."},{"title":"Technical Communication (MS)","code":"GRLS-LSTCCMMS","category":"Graduate","progcode":"GRLS","shortdesc":"ASU’s master of science in technical communication will provide you with knowledge and skills for the design, production and management of print and digital texts using traditional and developing technologies."},{"title":"Digital Audience Strategy (Graduate Certificate)","code":"GRND-CSDASGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Graduate Certificate in Digital Audiences prepares students to execute digital audience strategy in any industry. Students learn to measure and analyze how consumers interact with content online, on social media and on mobile devices. This program is designed for professionals who want to develop new skills, take on new responsibilities or more effectively promote their work."},{"title":"Technical Communication (Graduate Certificate)","code":"GRLS-LSTECGRCT","category":"Certificates","progcode":"GRLS","shortdesc":"The online Graduate Certificate in Technical Communication is designed to provide students with an introduction to the knowledge and skills to communicate effectively in a 21st century information environment."}],"Sustainability":[{"title":"Business - Sustainability (BA)","code":"UGBA-BABUSSBA","category":"Undergraduate","progcode":"UGBA","shortdesc":"ASU’s online Bachelor of Arts in business with a concentration in sustainability will provide you with the skills to help create an improved social and environmental quality of life for future generations."},{"title":"Sustainability (BA)","code":"UGSU-SUSUSTBA","category":"Undergraduate","progcode":"UGSU","shortdesc":"The online Bachelor of Arts in sustainability at ASU will provide you with the skills to rethink and reinvent a world at risk and help create an improved quality of life for future generations."},{"title":"Sustainability (BS)","code":"UGSU-SUSUSTBS","category":"Undergraduate","progcode":"UGSU","shortdesc":"The online Bachelor of Science in Sustainability at ASU will provide you with the skills to rethink and reinvent a world at risk and learn to create knowledge and solutions that will shape the quality of life for future generations."},{"title":"Biomimicry (MS)","code":"GRLA-LABMYMS","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Science in Biomimicry at ASU is a first of its kind program focusing on an emerging discipline that seeks to apply life’s strategies to human design. Offered in collaboration with Biomimicry 3.8 through The Biomimicry Center at ASU, the MS also complements the Certified Biomimicry Professional program offered by Biomimicry 3.8. "},{"title":"Sustainability Leadership (MSL)","code":"GRSU-SUSUSLMSL","category":"Graduate","progcode":"GRSU","shortdesc":"The Master of Sustainability Leadership (MSL) prepares professionals to advance social and environmental responsibility. The program teaches organizational leadership skills through the lens of sustainability. MSL equips graduates to drive high-impact global sustainability results for their companies, organizations and communities."},{"title":"Sustainable Engineering (MSE)","code":"GRES-ESSUEMSE","category":"Graduate","progcode":"GRES","shortdesc":"The online Master of Science in Engineering (MSE) in Sustainable Engineering is a multidisciplinary graduate program ideal for professionals and graduate level students with engineering and physical science backgrounds who wish to design a flexible, online, individualized plan of study."},{"title":"Sustainable Tourism (MST)","code":"GRPP-PPSUSTMST","category":"Graduate","progcode":"GRPP","shortdesc":"Students in ASU's Master of Sustainable Tourism (MST) receive a comprehensive education with a focus on the environmental, economic, and social aspects of tourism. Graduates are equipped with translatable skills necessary to create pioneering, sustainable development solutions to the challenges facing tourism today."},{"title":"Biomimicry (Graduate Certificate)","code":"GRND-LABMYGRCT","category":"Certificates","progcode":"GRND","shortdesc":"Are you a change-agent passionate about learning from the world of biology and its applications to human design?\n "},{"title":"Social Entrepreneurship and Community Development (Graduate Certificate)","code":"GRND-PPSECDGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The social entrepreneurship and community development certificate offered online through ASU provides a framework for harnessing social entrepreneurial and enterprise opportunities and creating transformative responses to challenges prevalent in societies and communities."},{"title":"Sustainable Tourism (Graduate Certificate)","code":"GRND-PPSTGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Graduate Certificate in sustainable tourism development from ASU addresses the unique character of sustainability and sustainable practices in tourism development and management."}],"Technology":[{"title":"Business Data Analytics (BS)","code":"UGBA-BABDABS","category":"Undergraduate","progcode":"UGBA","shortdesc":"The Bachelor of Science in business data analytics prepares business students with the requisite knowledge, skills and experience to create and manage big data initiatives as well as associated business processes to facilitate large-scale business data analytics in organizations."},{"title":"Computer Information Systems (BS)","code":"UGBA-BACISBS","category":"Undergraduate","progcode":"UGBA","shortdesc":"You will find your future with Computer Information Systems is limitless. The online W. P. Carey degree in computer information systems delivers the tools you need to meet rising demand for experts in systems analysis, business applications programming, web and mobile development, business database design, and decision support across public, private, nonprofit, and government entities worldwide."},{"title":"Geographic Information Science (BS)","code":"UGLA-LAGISBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online B.S. in Geographic Information Science is a unique STEM-based social science degree. Students will learn practical skills in GIS software, statistics, and computer programming within the context of real world applications. This online program is ideal for students interested in gaining marketable skills that allow them to address complex environmental and societal issues."},{"title":"Graphic Information Technology (BS)","code":"UGES-TSGITBS","category":"Undergraduate","progcode":"UGES","shortdesc":"The online Bachelor of Science in graphic information technology provides students with a creative, technological, and managerial understanding of graphic information and content creation. The program lives at the intersections of creativity, visual design and technology, preparing students to create visual content for multi-channel distribution – print, web, photo, video, animation."},{"title":"Information Technology (BS)","code":"UGES-TSIFTBS","category":"Undergraduate","progcode":"UGES","shortdesc":"The Bachelor of Science in information technology provides you with the expertise to design, select, implement and administer computer-based information solutions. "},{"title":"Internet & Web Development (Applied Science BAS)","code":"UGES-TSIWDBAS","category":"Undergraduate","progcode":"UGES","shortdesc":"ASU’s Bachelor of Applied Science in Internet and Web Development focuses on the development of web sites, including user experience design, usability, multimedia design, emerging Web technologies, and cross-media and cross-platform graphic applications. While the degree is entirely online, you will work with an adviser throughout your degree program to plan and schedule classes."},{"title":"Software Engineering (BS)","code":"UGES-TSSERBS","category":"Undergraduate","progcode":"UGES","shortdesc":"The online bachelor of science in software engineering degree at Arizona State University emphasizes flexibility in the context of project-driven engineering education, blending engineering, computing, project leadership and software construction."},{"title":"Technological Entrepreneurship and Management (BS)","code":"UGES-TSTEM2BS","category":"Undergraduate","progcode":"UGES","shortdesc":"The Bachelor of Science in technological entrepreneurship and management, offered online at Arizona State University, delivers a foundation in technology-based innovation with an emphasis on leadership, entrepreneurship and management fundamentals, as well as a special focus on project leadership and process innovation and development."},{"title":"Computer Science (MCS)","code":"GRES-ESCOMSCMCS","category":"Graduate","progcode":"GRES","shortdesc":"The Online Master of Computer Science (MCS) program, offered through an innovative partnership between ASU’s School of Computing, Informatics, and Decision Systems Engineering and Coursera, is a rigorous computing degree. You’ll gain a deep understanding of advanced topics like AI, cybersecurity, and big data while strengthening your new skill set through real-world projects."},{"title":"Educational Technology (MEd)","code":"GRTE-EDTECHMED","category":"Graduate","progcode":"GRTE","shortdesc":"The ASU Master of Education in educational technology prepares individuals to design, develop, and evaluate learning technology environments, systems, applications and instructional materials for a variety of formal and informal educational settings."},{"title":"Engineering Science in Software Engineering (MSE)","code":"GRES-ESSFEMSE","category":"Graduate","progcode":"GRES","shortdesc":"The Master of Science in Engineering with a concentration in Software Engineering offers specialized courses based on the fundamentals and principles of software engineering."},{"title":"Global Technology & Development (Applied International Development) (MS)","code":"GRFI-FIGTDAIDMS","category":"Graduate","progcode":"GRFI","shortdesc":"The online MS in Global Technology & Development (Applied International Development) allows students to choose an applied area of specialization, including education, business, management, public administration, or health.  It is tailored to one's experience and professional goals in international development; and it is an applied degree, emphasizing the skills and knowledge needed in the field."},{"title":"Global Technology & Development (MS)","code":"GRFI-LSGTDMS","category":"Graduate","progcode":"GRFI","shortdesc":"The Master of Science in global technology & development focuses on international socioeconomic and political change, emphasizing technology and the current processes of globalization."},{"title":"Graphic Information Technology (MSTech)","code":"GRES-TSGIMSTECH","category":"Graduate","progcode":"GRES","shortdesc":"Arizona State University's Master of Science in graphic information technology targets graphics professionals, supervisors and managers in a graphics or technology-oriented area who need advanced expertise in administering and managing digital content."},{"title":"Health Informatics (MAS)","code":"GRNH-GCHLHINMAS","category":"Graduate","progcode":"GRNH","shortdesc":"ASU’s Master of Advanced Study in Health Informatics, offered online through the Department of Biomedical Informatics, provides an innovative approach to combine information technology, computer science and knowledge management to improve health."},{"title":"Information Management (MS)","code":"GRBA-BAINFOMS","category":"Graduate","progcode":"GRBA","shortdesc":"The highly ranked W. P. Carey Master of Science in Information Management (MSIM) is designed to supply you with business skills needed to leverage IT knowledge and gain a competitive advantage in the global economy. This 16-month online degree program is designed for IT professionals with at least two years of work experience and who are planning to work full-time while attending school."},{"title":"Information Technology (MS)","code":"GRES-TSIFTMS","category":"Graduate","progcode":"GRES","shortdesc":"Students who select the online Master of Science in Information Technology obtain advanced technology skills in networking, cybersecurity, and information systems that prepare them for careers in industry, education or government."},{"title":"Advanced Analytics in Higher Education (Graduate Certificate)","code":"GRND-TEAAHEGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The graduate certificate in Advanced Analytics in Higher Education at ASU Online prepares professionals to conduct advanced analytics and assist university personnel in making data-driven decisions for higher and postsecondary education. "},{"title":"Global Development and Innovation (Graduate Certificate)","code":"GRND-FIGDIGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online graduate certificate program in global development and innovation helps students translate their imaginations into innovations by mobilizing knowledge in the service of human needs. It provides current and critical perspectives on innovation and development for overseeing and managing complex global challenges."}],"Public Service & Public Policy":[{"title":"Community Advocacy and Social Policy (BA)","code":"UGPP-PPCASPBA","category":"Undergraduate","progcode":"UGPP","shortdesc":"The Bachelor of Arts in Community Advocacy and Social Policy through the School of Social Work is designed to offer you the opportunity to explore issues of diversity, oppression, and privilege and to examine advocacy and intervention strategies to engage in social change."},{"title":"Global Studies (BA)","code":"UGLA-LASGSBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"Study global issues at one of the top universities in the nation. The Online Bachelors of Arts (BA) in Global Studies, is designed to link theory with global issues and action through policy."},{"title":"Justice Studies (BS)","code":"UGLA-LAJUSBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"ASU’s Bachelor of Science in Justice Studies online program will enable students to study social justice and learn about the historical, cultural and social forces that shape our society. Students will gain skills needed to create meaning, real-world change through law, policy and social justice."},{"title":"Political Science (BA)","code":"UGLA-LAPOSBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"ASU's online BA in Political Science provides you with the skills and knowledge to lead within a democratic system of government and in the rapid globalization of political institutions. You will be trained to link theory with real world problems and ideas, and while learning from renowned faculty, you will benefit from a classic yet contemporary liberal arts education."},{"title":"Political Science (BS)","code":"UGLA-LAPOSBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"Offered through ASU’s College of Liberal Arts and Sciences, the online Bachelor of Science in Political Science is the study of how citizens interact with their governments and how governments at all levels formulate policies to serve their citizens."},{"title":"Psychology - Forensic Psychology (BA)","code":"UGAS-ASPGSFPBA","category":"Undergraduate","progcode":"UGAS","shortdesc":"Forensic psychology is the application of psychology to the law. The online Bachelor of Arts in Psychology with a concentration in Forensic Psychology combines general training in psychology with specialized coursework in criminal law, criminal behavior, the diagnosis and treatment of mental disorders and legal decision-making."},{"title":"Psychology - Forensic Psychology (BS)","code":"UGAS-ASPGSFPBS","category":"Undergraduate","progcode":"UGAS","shortdesc":"Crime and mental health is a global issue that is growing rapidly. With ASU’s online Bachelor of Science (BS) in Psychology with a concentration in Forensic Psychology, students will focus on the scientific process between law and psychology."},{"title":"Public Service and Public Policy (BS)","code":"UGPP-PPPAFBS","category":"Undergraduate","progcode":"UGPP","shortdesc":"The online Bachelor of Science in public service and public policy prepares you for careers that transform government, nonprofit organizations, and policy at all levels."},{"title":"Public Service and Public Policy - Emergency Management Homeland Security (BS)","code":"UGPP-PPPAFEHBS","category":"Undergraduate","progcode":"UGPP","shortdesc":"Arizona State University’s Bachelor of Science in public service and public policy online degree with a concentration in emergency management and homeland security prepares you to tackle complex issues of both mitigation of and response to natural or man-made disasters."},{"title":"Tourism and Recreation Management (BS)","code":"UGPP-PPTRMBS","category":"Undergraduate","progcode":"UGPP","shortdesc":"The online Bachelor of Science in Tourism and Recreation Management program is an integrated degree that includes a core providing the foundation for management of leisure enterprises. The core is enhanced by emphasis areas that direct students toward one of four specializations: tourism, recreation, events or sports."},{"title":"Biomimicry (MS)","code":"GRLA-LABMYMS","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Science in Biomimicry at ASU is a first of its kind program focusing on an emerging discipline that seeks to apply life’s strategies to human design. Offered in collaboration with Biomimicry 3.8 through The Biomimicry Center at ASU, the MS also complements the Certified Biomimicry Professional program offered by Biomimicry 3.8. "},{"title":"Biosecurity and Threat Management (MA)","code":"GRPP-PPEMHSBTMA","category":"Graduate","progcode":"GRPP","shortdesc":"The Biosecurity and Threat Management concentration of the Emergency Management and Homeland Security (EMHS) master’s degree prepares students to utilize best practices toward protecting living organisms against hazardous biological agents."},{"title":"Community Resilience (MA)","code":"GRPP-PPEMHSCRMA","category":"Graduate","progcode":"GRPP","shortdesc":"The Community Resilience concentration of the Emergency Management and Homeland Security (EMHS) master’s degree provides the knowledge, skills, and abilities required to tackle current and future challenges faced by cities globally."},{"title":"Cybersecurity Policy and Management (MA)","code":"GRPP-PPEHSCPMMA","category":"Graduate","progcode":"GRPP","shortdesc":"The Cybersecurity Policy and Management concentration within the EMHS program prepares students to utilize knowledge, skills and abilities in the emerging area of cybersecurity threats relevant to critical infrastructure protection and other key operations. Program graduates will help a wide range of organizations improve risk mitigation and risk management for natural and human-made hazards. "},{"title":"Emergency Management (MA)","code":"GRPP-PPEMHSEMMA","category":"Graduate","progcode":"GRPP","shortdesc":"Become a professional in helping communities manage crisis settings with the Emergency Management concentration of the Emergency Management and Homeland Security (EMHS) master’s degree."},{"title":"Emergency Management and Homeland Security (EMHS)","code":"GRPP-PPEMHSMA","category":"Graduate","progcode":"GRPP","shortdesc":"Become a professional in areas related to emergency and disaster management, hazards management, public safety and homeland security. The Master of Arts in Emergency Management and Homeland Security (EMHS) degree program promotes stronger and more resilient communities by helping prepare our students to engage in the effective management of hazards and crises."},{"title":"Executive Master of Public Administration (EMPA)","code":"GRPP-PPPUAEMPA","category":"Graduate","progcode":"GRPP","shortdesc":"Ranked nationally in the top 5% by US News & World Report, the ASU School of Public Affairs is launching an Executive Master of Public Administration (EMPA) degree in collaboration with the McCain Institute for International Leadership. The EMPA program is designed to develop an executive leaders’ capacity for effective decision-making."},{"title":"Forensic Psychology (MS)","code":"GRAS-ASFPSYMS","category":"Graduate","progcode":"GRAS","shortdesc":"Forensic psychology is the study of how mental health and human behavior intersect with the law and the criminal justice system. This online Master of Science in Forensic Psychology program provides an overview of forensic psychology for students interested in career advancement, additional graduate study, or personal interest."},{"title":"Homeland Security (MA)","code":"GRPP-PPEMHSHSMA","category":"Graduate","progcode":"GRPP","shortdesc":"Individuals interested in pursuing a program of study focused on homeland security policies and programs can pursue a concentration in Homeland Security from the Emergency Management and Homeland Security (EMHS) master’s degree."},{"title":"Legal Studies (MLS)","code":"LWLW-LWLGSMLEGS","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies at Arizona State University is a unique advanced legal degree for non-lawyers. Offered through ASU’s Sandra Day O’Connor College of Law, this 30-credit program enables professionals to gain a foundation in U.S. law in as little as one year and without pursuing a full law degree."},{"title":"Nonprofit Leadership and Management (MNLM)","code":"GRPP-PPNPSMNS","category":"Graduate","progcode":"GRPP","shortdesc":"The Master of Nonprofit Leadership and Management (MNLM) degree is intended for professionals who work in or desire to work in the nonprofit sector. This online program provides an opportunity to obtain an advanced degree that addresses the unique character of nonprofit organizations and the social sector."},{"title":"Public Safety Leadership and Administration (PSLA)","code":"GRPP-PPPSLAMPSL","category":"Graduate","progcode":"GRPP","shortdesc":"The value of the Master of Arts in Public Safety Leadership and Administration degree program resides in its innovative and interdisciplinary curriculum and quality of instruction. This online degree prepares you, as a public safety professional, with the skills and knowledge necessary to manage and assume positions of leadership in public safety organizations."},{"title":"Biomimicry (Graduate Certificate)","code":"GRND-LABMYGRCT","category":"Certificates","progcode":"GRND","shortdesc":"Are you a change-agent passionate about learning from the world of biology and its applications to human design?\n "},{"title":"Criminal Sentencing and Sentencing Advocacy (Graduate Certificate)","code":"GRND-PPCSAGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Graduate Certificate in criminal sentencing and sentencing advocacy is offered collaboratively by ASU's School of Social Work and the School of Criminology and Criminal Justice. This program is ideal if you are a criminal justice professional looking for career advancement or additional expertise in your field."},{"title":"Social Entrepreneurship and Community Development (Graduate Certificate)","code":"GRND-PPSECDGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The social entrepreneurship and community development certificate offered online through ASU provides a framework for harnessing social entrepreneurial and enterprise opportunities and creating transformative responses to challenges prevalent in societies and communities."}],"Criminal Justice & Law":[{"title":"Criminology and Criminal Justice (BS)","code":"UGPP-PPCRIMJBS","category":"Undergraduate","progcode":"UGPP","shortdesc":"The Bachelor of Science in criminology and criminal justice offers you the chance to explore the impact of crime and effective approaches to reduce it at the local, state, and federal level. "},{"title":"Justice Studies (BS)","code":"UGLA-LAJUSBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"ASU’s Bachelor of Science in Justice Studies online program will enable students to study social justice and learn about the historical, cultural and social forces that shape our society. Students will gain skills needed to create meaning, real-world change through law, policy and social justice."},{"title":"Political Science (BA)","code":"UGLA-LAPOSBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"ASU's online BA in Political Science provides you with the skills and knowledge to lead within a democratic system of government and in the rapid globalization of political institutions. You will be trained to link theory with real world problems and ideas, and while learning from renowned faculty, you will benefit from a classic yet contemporary liberal arts education."},{"title":"Political Science (BS)","code":"UGLA-LAPOSBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"Offered through ASU’s College of Liberal Arts and Sciences, the online Bachelor of Science in Political Science is the study of how citizens interact with their governments and how governments at all levels formulate policies to serve their citizens."},{"title":"Psychology - Forensic Psychology (BA)","code":"UGAS-ASPGSFPBA","category":"Undergraduate","progcode":"UGAS","shortdesc":"Forensic psychology is the application of psychology to the law. The online Bachelor of Arts in Psychology with a concentration in Forensic Psychology combines general training in psychology with specialized coursework in criminal law, criminal behavior, the diagnosis and treatment of mental disorders and legal decision-making."},{"title":"Psychology - Forensic Psychology (BS)","code":"UGAS-ASPGSFPBS","category":"Undergraduate","progcode":"UGAS","shortdesc":"Crime and mental health is a global issue that is growing rapidly. With ASU’s online Bachelor of Science (BS) in Psychology with a concentration in Forensic Psychology, students will focus on the scientific process between law and psychology."},{"title":"Public Service and Public Policy (BS)","code":"UGPP-PPPAFBS","category":"Undergraduate","progcode":"UGPP","shortdesc":"The online Bachelor of Science in public service and public policy prepares you for careers that transform government, nonprofit organizations, and policy at all levels."},{"title":"Public Service and Public Policy - Emergency Management Homeland Security (BS)","code":"UGPP-PPPAFEHBS","category":"Undergraduate","progcode":"UGPP","shortdesc":"Arizona State University’s Bachelor of Science in public service and public policy online degree with a concentration in emergency management and homeland security prepares you to tackle complex issues of both mitigation of and response to natural or man-made disasters."},{"title":"Biosecurity and Threat Management (MA)","code":"GRPP-PPEMHSBTMA","category":"Graduate","progcode":"GRPP","shortdesc":"The Biosecurity and Threat Management concentration of the Emergency Management and Homeland Security (EMHS) master’s degree prepares students to utilize best practices toward protecting living organisms against hazardous biological agents."},{"title":"Community Resilience (MA)","code":"GRPP-PPEMHSCRMA","category":"Graduate","progcode":"GRPP","shortdesc":"The Community Resilience concentration of the Emergency Management and Homeland Security (EMHS) master’s degree provides the knowledge, skills, and abilities required to tackle current and future challenges faced by cities globally."},{"title":"Corporate and Health Care Compliance (MLS)","code":"LWLW-LWLGSMLEGS--CORPHEALTHCOMP","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies in Corporate and Health Care Compliance, offered through ASU’s Sandra Day O’Connor College of Law, prepares students to move up the ladder in their current career or to pursue new and exciting career opportunities."},{"title":"Criminal Justice (MA)","code":"GRPP-PPCRIMJMA","category":"Graduate","progcode":"GRPP","shortdesc":"The Master of Arts in Criminal Justice (MACJ) provides you with the knowledge and skills to advance your criminal justice career. You will study the larger context of crime, why it exists and its impact on society, as well as gain a detailed understanding of the concept of justice and how it’s applied."},{"title":"Criminal Law (MLS)","code":"LWLW-LWLGSMLEGS--CRIMLAW","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies in Criminal Law, offered through ASU’s Sandra Day O’Connor College of Law, provides students with valuable expertise regarding how and why the criminal justice system operates the way it does."},{"title":"Cybersecurity Policy and Management (MA)","code":"GRPP-PPEHSCPMMA","category":"Graduate","progcode":"GRPP","shortdesc":"The Cybersecurity Policy and Management concentration within the EMHS program prepares students to utilize knowledge, skills and abilities in the emerging area of cybersecurity threats relevant to critical infrastructure protection and other key operations. Program graduates will help a wide range of organizations improve risk mitigation and risk management for natural and human-made hazards. "},{"title":"Emergency Management (MA)","code":"GRPP-PPEMHSEMMA","category":"Graduate","progcode":"GRPP","shortdesc":"Become a professional in helping communities manage crisis settings with the Emergency Management concentration of the Emergency Management and Homeland Security (EMHS) master’s degree."},{"title":"Emergency Management and Homeland Security (EMHS)","code":"GRPP-PPEMHSMA","category":"Graduate","progcode":"GRPP","shortdesc":"Become a professional in areas related to emergency and disaster management, hazards management, public safety and homeland security. The Master of Arts in Emergency Management and Homeland Security (EMHS) degree program promotes stronger and more resilient communities by helping prepare our students to engage in the effective management of hazards and crises."},{"title":"Emergency Medical Services - Mobile Integrated Healthcare (MA)","code":"GRPP-PPPSEMMPSL","category":"Graduate","progcode":"GRPP","shortdesc":"The Emergency Medical Services - Mobile Integrated Healthcare concentration in the Master of Arts in Public Safety Leadership and Administration (PSLA) degree program provides students with the necessary skills to help save lives as a pre-hospital emergency care practitioner."},{"title":"Executive Fire Administration (MA)","code":"GRPP-PPPSEFMPSL","category":"Graduate","progcode":"GRPP","shortdesc":"Lead change and implement innovation in fire and emergency services organizations through the Executive Fire Administration concentration in the Master of Arts in Public Safety Leadership and Administration (PSLA) degree program."},{"title":"Executive Police Administration (MA)","code":"GRPP-PPPSEPMPSL","category":"Graduate","progcode":"GRPP","shortdesc":"Gain leadership skills to influence the future of law enforcement agencies with the Executive Police Administration concentration in the Master of Arts in Public Safety Leadership and Administration (PSLA) degree program."},{"title":"Forensic Psychology (MS)","code":"GRAS-ASFPSYMS","category":"Graduate","progcode":"GRAS","shortdesc":"Forensic psychology is the study of how mental health and human behavior intersect with the law and the criminal justice system. This online Master of Science in Forensic Psychology program provides an overview of forensic psychology for students interested in career advancement, additional graduate study, or personal interest."},{"title":"Global Security (MA)","code":"GRLA-LAGSCMA","category":"Graduate","progcode":"GRLA","shortdesc":"The Master of Arts in Global Security is an interdisciplinary, online program that trains students to critically engage global conflict and international security issues in a comprehensive manner to aid professional advancement in military, government and private sector careers."},{"title":"Homeland Security (MA)","code":"GRPP-PPEMHSHSMA","category":"Graduate","progcode":"GRPP","shortdesc":"Individuals interested in pursuing a program of study focused on homeland security policies and programs can pursue a concentration in Homeland Security from the Emergency Management and Homeland Security (EMHS) master’s degree."},{"title":"HR & Employment Law (MLS)","code":"LWLW-LWLGSMLEGS--HRELAW","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies in HR & Employment Law, offered through ASU’s Sandra Day O’Connor College of Law, prepares students to move up the ladder in their current career or to pursue new and exciting career opportunities."},{"title":"Intellectual Property Law (MLS)","code":"LWLW-LWLGSMLEGS--INTPROPLAW","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies in Intellectual Property Law, provides students with a basic understanding of U.S. law, legal structures, and legal reasoning."},{"title":"Legal Studies (MLS)","code":"LWLW-LWLGSMLEGS","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies at Arizona State University is a unique advanced legal degree for non-lawyers. Offered through ASU’s Sandra Day O’Connor College of Law, this 30-credit program enables professionals to gain a foundation in U.S. law in as little as one year and without pursuing a full law degree."},{"title":"Public Safety Leadership and Administration (PSLA)","code":"GRPP-PPPSLAMPSL","category":"Graduate","progcode":"GRPP","shortdesc":"The value of the Master of Arts in Public Safety Leadership and Administration degree program resides in its innovative and interdisciplinary curriculum and quality of instruction. This online degree prepares you, as a public safety professional, with the skills and knowledge necessary to manage and assume positions of leadership in public safety organizations."},{"title":"Sports Law and Business","code":"LWLW-LWLGSMLEGS--SPORLAWBUIS","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies in Sports Law and Business focuses on solving problems arising in the sports industry using legal and business forces."},{"title":"Sustainability Law","code":"LWLW-LWLGSMLEGS--SUSTLAW","category":"Graduate","progcode":"LWLW","shortdesc":"The online Master of Legal Studies in Sustainability Law is a unique advanced legal degree for non-lawyers. Offered through ASU’s Sandra Day O’Connor College of Law, this program is taught by trained lawyers who are invaluable assets and influential leaders in policy dialogue and implementation locally, nationally, and internationally."},{"title":"Corrections Management (Graduate Certificate)","code":"GRND-PPCMGGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Graduate Certificate in Corrections Management enhances your skillset as a corrections administration professional through topics like criminal justice organizations, institutional management, corrections and community supervision and in cross-disciplines such as public administration."},{"title":"Criminal Sentencing and Sentencing Advocacy (Graduate Certificate)","code":"GRND-PPCSAGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Graduate Certificate in criminal sentencing and sentencing advocacy is offered collaboratively by ASU's School of Social Work and the School of Criminology and Criminal Justice. This program is ideal if you are a criminal justice professional looking for career advancement or additional expertise in your field."},{"title":"Homeland Security (Undergraduate Certificate)","code":"UGNFA-PPHSLCERT","category":"Certificates","progcode":"UGNFA","shortdesc":"The online undergraduate certificate in Homeland Security provides you with skills and credentials that will prepare you to enter career fields specializing in Homeland Security."},{"title":"Law Enforcement Administration (Graduate Certificate)","code":"GRND-PPLEAGRCT","category":"Certificates","progcode":"GRND","shortdesc":"Arizona State University’s online Graduate Certificate in Law Enforcement Administration prepares law enforcement professionals through comprehensive coverage of topics in criminal justice organizations, policing and program analysis, and cross-disciplines such as public administration."}],"Liberal Studies":[{"title":"Digital Audiences (BS)","code":"UGCS-CSDIGABS","category":"Undergraduate","progcode":"UGCS","shortdesc":"The online Bachelor of Science in Digital Audiences gives students the skills they need to use digital and social media to deepen impact in any industry, including strategy development, digital analytics, SEO and SEM campaigns, paid and organic social campaigns, audience research and more."},{"title":"Interdisciplinary Studies (BA)","code":"UGLS-LSBISBIS","category":"Undergraduate","progcode":"UGLS","shortdesc":"ASU’s online Bachelor of Interdisciplinary Studies offers you the opportunity to design your major around multiple interests and prepares you for careers that cross-disciplinary boundaries. As a BIS student, you will learn about answering questions, solving problems and addressing contemporary social issues from multiple perspectives, all while designing your own educational plans."},{"title":"Interdisciplinary Studies - Organizational Studies (BA)","code":"UGLS-LSORGBIS","category":"Undergraduate","progcode":"UGLS","shortdesc":"The online Bachelor of Interdisciplinary Studies with a concentration in organizational studies is designed for students seeking an interdisciplinary degree and a desire to learn about the dynamics of contemporary organizations."},{"title":"Liberal Studies (BLS)","code":"UGLS-LABLSBLS","category":"Undergraduate","progcode":"UGLS","shortdesc":"The Bachelor of Liberal Studies program offers you the opportunity to study a broad array of disciplines. This online program offered through ASU aims to provide you with the foundation to use knowledge in a manner that will help you become more successful thinkers, decision-makers and leaders."},{"title":"Digital Audience Strategy (MS)","code":"GRCS-CSDASMS","category":"Graduate","progcode":"GRCS","shortdesc":"The online Master of Science in Digital Audience Strategy prepares students to design and execute large-scale digital audience strategy through a data-driven, multidisciplinary, hands-on curriculum. Students learn to measure and analyze how consumers interact with content online, on social media and on mobile devices."},{"title":"Liberal Studies (MLSt)","code":"GRLA-LAMLSMLS","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Liberal Studies offers students a multidisciplinary approach to human ideas and values. This program, offered through ASU's College of Liberal Arts and Sciences, is intended for students seeking a graduate degree that explores the integration of the humanities with political, religious, social and scientific questions within their cultural contexts. "},{"title":"Digital Audience Strategy (Graduate Certificate)","code":"GRND-CSDASGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Graduate Certificate in Digital Audiences prepares students to execute digital audience strategy in any industry. Students learn to measure and analyze how consumers interact with content online, on social media and on mobile devices. This program is designed for professionals who want to develop new skills, take on new responsibilities or more effectively promote their work."}],"Education":[{"title":"Educational Studies (BAE)","code":"UGTE-EDSLSTBAE","category":"Undergraduate","progcode":"UGTE","shortdesc":"ASU's online Educational Studies program qualifies graduates for a variety of career paths working to educate individuals in nonprofit or government organizations, private educational or recreational settings, or as entrepreneurs in a variety of learning environments."},{"title":"Curriculum and Instruction: Autism Spectrum Disorders (MEd)","code":"GRTE-TEASDMED","category":"Graduate","progcode":"GRTE","shortdesc":"ASU's Master of Education in curriculum and instruction: autism spectrum disorders equips individuals with specialized skills and knowledge to work effectively and compassionately with children and adults affected with autism."},{"title":"Curriculum and Instruction: Early Childhood Education (MEd)","code":"GRTE-TEECDMED","category":"Graduate","progcode":"GRTE","shortdesc":"ASU's Master of Education in curriculum and instruction is offered fully online, pairing flexibility with academic excellence. This master's program will prepare you to meet the educational, social and emotional needs of children from birth through 8 years old."},{"title":"Curriculum and Instruction: English as a Second Language (MA)","code":"GRTE-EDESLMA","category":"Graduate","progcode":"GRTE","shortdesc":"ASU's Master of Arts in curriculum and instruction: English as a second language (ESL) prepares you to teach English language learners in a variety of settings, including U.S. schools. This program caters to professionals with a wide range of roles, including both new and experienced teachers, administrators, policymakers and community workers."},{"title":"Curriculum and Instruction: Gifted Education (MEd)","code":"GRTE-TEGEDMED","category":"Graduate","progcode":"GRTE","shortdesc":"ASU's Master of Education in curriculum and instruction: gifted education prepares teachers, school administrators, school psychologists, behavior analysts, and family members to work effectively with gifted children."},{"title":"Educational Leadership (Principalship) (MEd)","code":"GRTE-TEPRINMED","category":"Graduate","progcode":"GRTE","shortdesc":"ASU's Master of Education in educational leadership, principalship degree is designed for aspiring principals or teachers interested in becoming leaders in their schools and districts."},{"title":"Educational Technology (MEd)","code":"GRTE-EDTECHMED","category":"Graduate","progcode":"GRTE","shortdesc":"The ASU Master of Education in educational technology prepares individuals to design, develop, and evaluate learning technology environments, systems, applications and instructional materials for a variety of formal and informal educational settings."},{"title":"Indigenous Education (MA)","code":"GRLA-LAIEDMA","category":"Graduate","progcode":"GRLA","shortdesc":"The online Indigenous Education MA degree program emphasizes research, theory, and practice related to both education and the process of schooling. This program engages individuals who are interested in or currently working with and in Indigenous communities or schools serving Indigenous children."},{"title":"Leadership and Innovation (EdD)","code":"GRTE-TELINEDD","category":"Graduate","progcode":"GRTE","shortdesc":"ASU’s Doctor of Education (EdD) in Leadership and Innovation is designed for practicing educator-leaders who work in a range of settings and want to lead change and implement innovation to improve their practice and create better learning opportunities for students of all ages."},{"title":"Special Education (Applied Behavior Analysis) (MA)","code":"GRTE-TESPEABAMA","category":"Graduate","progcode":"GRTE","shortdesc":"ASU Online's Master of Arts in Special Education with a concentration in Applied Behavior Analysis (ABA) pairs research and experience to prepare students to work professionally with individuals with special learning and behavior needs using the principles of applied behavior analysis."},{"title":"Teaching English to Speakers of Other Languages (MTESOL)","code":"GRLA-LAENGMTESL","category":"Graduate","progcode":"GRLA","shortdesc":"The master's degree program in Teaching English to Speakers of Other Languages (TESOL) is for individuals who wish to build a career in the international field of English language teaching."},{"title":"Advanced Analytics in Higher Education (Graduate Certificate)","code":"GRND-TEAAHEGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The graduate certificate in Advanced Analytics in Higher Education at ASU Online prepares professionals to conduct advanced analytics and assist university personnel in making data-driven decisions for higher and postsecondary education. "},{"title":"An Overview of Autism Spectrum Disorders (Graduate Certificate)","code":"GRTE-EDSPEGRCA","category":"Certificates","progcode":"GRTE","shortdesc":"ASU’s Graduate Certificate in autism spectrum disorders is ideal for educators, interventionists, psychologists, pathologists, behavior analysts, or family members who want to enhance their preparation for working with children and adults affected with autism spectrum disorders."},{"title":"Applied Behavior Analysis (Graduate Certificate)","code":"GRTE-TEABAGRCT","category":"Certificates","progcode":"GRTE","shortdesc":"ASU’s online Graduate Certificate in Applied Behavior Analysis pairs research and experience to prepare professionals to work with individuals with special learning and behavior needs. Courses enable students to focus on the population with whom they plan to work, as well as to gain knowledge and skills to use ABA across a variety of settings. "},{"title":"English as a Second Language (Graduate Certificate)","code":"GRTE-TEESLGRCT","category":"Certificates","progcode":"GRTE","shortdesc":"ASU‘s online graduate certificate in English as a Second Language (ESL) prepares you to teach English language learners in a variety of settings, including U.S. schools."},{"title":"Gifted Education (Graduate Certificate)","code":"GRTE-TEGEDGRCT","category":"Certificates","progcode":"GRTE","shortdesc":"ASU’s online graduate certificate in Gifted Education prepares teachers, school administrators, school psychologists, behavior analysts, and family members to work effectively with gifted children."}],"Engineering":[{"title":"Electrical Engineering (BSE)","code":"UGES-ESEEEBSE","category":"Undergraduate","progcode":"UGES","shortdesc":"From nanoscale electronic devices to the U.S. electric power grid, the Electrical Engineering degree program at ASU will prepare you for a career in areas including energy production and distribution, information processing and management, healthcare technology and delivery, global sustainable development, economic growth and security, and communications and data networking."},{"title":"Electrical Engineering - Electric Power and Energy Systems (BSE)","code":"UGES-ESEEEPBSE","category":"Undergraduate","progcode":"UGES","shortdesc":"The online BSE in Electrical Engineering with a concentration in Electric Power and Energy Systems prepares students for careers in electric power industries, including power generation, transmission and utilization. The degree includes conventional power generation and alternative energy systems."},{"title":"Engineering Management (BSE)","code":"UGES-ESEMGBSE","category":"Undergraduate","progcode":"UGES","shortdesc":"The Bachelor of Science in Engineering (BSE) program in engineering management is designed to provide you with the skills for effective management and leadership of engineering-driven enterprises."},{"title":"Graphic Information Technology (BS)","code":"UGES-TSGITBS","category":"Undergraduate","progcode":"UGES","shortdesc":"The online Bachelor of Science in graphic information technology provides students with a creative, technological, and managerial understanding of graphic information and content creation. The program lives at the intersections of creativity, visual design and technology, preparing students to create visual content for multi-channel distribution – print, web, photo, video, animation."},{"title":"Information Technology (BS)","code":"UGES-TSIFTBS","category":"Undergraduate","progcode":"UGES","shortdesc":"The Bachelor of Science in information technology provides you with the expertise to design, select, implement and administer computer-based information solutions. "},{"title":"Internet & Web Development (Applied Science BAS)","code":"UGES-TSIWDBAS","category":"Undergraduate","progcode":"UGES","shortdesc":"ASU’s Bachelor of Applied Science in Internet and Web Development focuses on the development of web sites, including user experience design, usability, multimedia design, emerging Web technologies, and cross-media and cross-platform graphic applications. While the degree is entirely online, you will work with an adviser throughout your degree program to plan and schedule classes."},{"title":"Operations Management (Applied Science BAS)","code":"UGES-TSIMCOBAS","category":"Undergraduate","progcode":"UGES","shortdesc":"The Bachelor of Applied Sciences with a concentration in operations management technology, offered online through ASU’s Ira A. Fulton Schools of Engineering, will provide you with the tools needed for success as a manager, including organization, motivation and hiring skills, as well as resource development."},{"title":"Software Engineering (BS)","code":"UGES-TSSERBS","category":"Undergraduate","progcode":"UGES","shortdesc":"The online bachelor of science in software engineering degree at Arizona State University emphasizes flexibility in the context of project-driven engineering education, blending engineering, computing, project leadership and software construction."},{"title":"Technological Entrepreneurship and Management (BS)","code":"UGES-TSTEM2BS","category":"Undergraduate","progcode":"UGES","shortdesc":"The Bachelor of Science in technological entrepreneurship and management, offered online at Arizona State University, delivers a foundation in technology-based innovation with an emphasis on leadership, entrepreneurship and management fundamentals, as well as a special focus on project leadership and process innovation and development."},{"title":"Biomimicry (MS)","code":"GRLA-LABMYMS","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Science in Biomimicry at ASU is a first of its kind program focusing on an emerging discipline that seeks to apply life’s strategies to human design. Offered in collaboration with Biomimicry 3.8 through The Biomimicry Center at ASU, the MS also complements the Certified Biomimicry Professional program offered by Biomimicry 3.8. "},{"title":"Computer Science (MCS)","code":"GRES-ESCOMSCMCS","category":"Graduate","progcode":"GRES","shortdesc":"The Online Master of Computer Science (MCS) program, offered through an innovative partnership between ASU’s School of Computing, Informatics, and Decision Systems Engineering and Coursera, is a rigorous computing degree. You’ll gain a deep understanding of advanced topics like AI, cybersecurity, and big data while strengthening your new skill set through real-world projects."},{"title":"Construction Management (MS)","code":"GRES-ESCONSTMS","category":"Graduate","progcode":"GRES","shortdesc":"Arizona State University's Master of Science in construction management degree is designed to meet the growing need for professionals with advanced technical, management and applied research skills in the construction industry."},{"title":"Electrical Engineering (MSE)","code":"GRES-ESEEMSE","category":"Graduate","progcode":"GRES","shortdesc":"The MSE in electrical engineering degree offers areas of study in physical electronics and photonics, electronic and mixed-signal circuit design, signal processing and communications and electromagnetic, antennas and microwave circuits."},{"title":"Engineering Science in Software Engineering (MSE)","code":"GRES-ESSFEMSE","category":"Graduate","progcode":"GRES","shortdesc":"The Master of Science in Engineering with a concentration in Software Engineering offers specialized courses based on the fundamentals and principles of software engineering."},{"title":"Engineering: Engineering Management (MEng)","code":"GRES-ESENGRMENG--ENGMGT","category":"Graduate","progcode":"GRES","shortdesc":"The Engineering Management (MEng) graduate degree online can help you apply your existing technical skills and practical experience to leading diverse teams, projects and operations in the field of engineering."},{"title":"Engineering: Quality, Reliability and Statistical Engineering (MEng)","code":"GRES-ESENGRMENG--QRSE","category":"Graduate","progcode":"GRES","shortdesc":"Arizona State University's Master of Engineering in quality, reliability, and statistical engineering offers specialized courses founded on basic engineering and statistics principles that are central to improving quality, reliability, and achieving meaningful results in today's modern business organizations."},{"title":"Engineering: Systems Engineering (MEng)","code":"GRES-ESENGRMENG--SYSENG","category":"Graduate","progcode":"GRES","shortdesc":"The Master of Engineering in systems engineering provides you with the ability to engineer complex products, processes and services, while leveraging a systems engineering approach. "},{"title":"Graphic Information Technology (MSTech)","code":"GRES-TSGIMSTECH","category":"Graduate","progcode":"GRES","shortdesc":"Arizona State University's Master of Science in graphic information technology targets graphics professionals, supervisors and managers in a graphics or technology-oriented area who need advanced expertise in administering and managing digital content."},{"title":"Industrial Engineering (MS)","code":"GRES-ESINDENMS","category":"Graduate","progcode":"GRES","shortdesc":"The Master of Science in industrial engineering is among the top 20 programs in the nation as ranked by U.S. News & World Report. We are thrilled to now offer it online. As an online student, you will learn from the same world-class faculty who teach on ground and who consistently receive awards for teaching and research excellence."},{"title":"Information Technology (MS)","code":"GRES-TSIFTMS","category":"Graduate","progcode":"GRES","shortdesc":"Students who select the online Master of Science in Information Technology obtain advanced technology skills in networking, cybersecurity, and information systems that prepare them for careers in industry, education or government."},{"title":"Materials Science and Engineering (MS)","code":"GRES-ESMATEMS","category":"Graduate","progcode":"GRES","shortdesc":"The electronics industry has grown to become a $2 trillion-dollar market, exceeding investments made in other industries such as transportation or steel. The MS in materials science and engineering offers you an opportunity to advance in this fast-growing field and provides an in-depth study of materials science and engineering topics."},{"title":"MBA/MS - Industrial Engineering","code":"GRES-ESINDENMS,BAONLINMBA","category":"Graduate","progcode":"GRES","shortdesc":"The MBA/Engineering concurrent degree program at Arizona State University combines advanced courses in technical areas with a rigorous management curriculum. The MBA/MS in Industrial Engineering is designed for working professionals who need to stay current in their area of expertise and develop enhanced business acumen."},{"title":"MBA/MSE - Electrical Engineering","code":"GRES-ESEEMSE,BAONLINMBA","category":"Graduate","progcode":"GRES","shortdesc":"The MBA/Engineering concurrent degree program at Arizona State University combines advanced courses in technical areas with a rigorous management curriculum. The MBA/MSE in Electrical Engineering is designed for working professionals who need to stay current in their area of expertise and develop enhanced business acumen."},{"title":"Sustainable Engineering (MSE)","code":"GRES-ESSUEMSE","category":"Graduate","progcode":"GRES","shortdesc":"The online Master of Science in Engineering (MSE) in Sustainable Engineering is a multidisciplinary graduate program ideal for professionals and graduate level students with engineering and physical science backgrounds who wish to design a flexible, online, individualized plan of study."},{"title":"Biomimicry (Graduate Certificate)","code":"GRND-LABMYGRCT","category":"Certificates","progcode":"GRND","shortdesc":"Are you a change-agent passionate about learning from the world of biology and its applications to human design?\n "},{"title":"Lean Six Sigma Black Belt (Graduate Certificate)","code":"GRND-ESLSSBGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The online Lean Six Sigma Black Belt graduate certificate is aimed at engineers and managers who oversee tactical and strategic projects as well as various operational functions in their organizations."},{"title":"Nuclear Power Generation (Graduate Certificate)","code":"GRND-ESNPGGRCT","category":"Certificates","progcode":"GRND","shortdesc":"The Nuclear Power Generation (NPG) graduate certificate is a multidisciplinary professional option within ASU's Ira A. Fulton Schools of Engineering."}],"Language":[{"title":"English (BA)","code":"UGLA-LAENGBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The Bachelor of Arts in English gives you the opportunity to pursue your degree completely online. This degree will prepare you to read and write critically in a variety of print and digital genres and develop strong literacy skills. "},{"title":"Spanish (BA)","code":"UGLA-LASPABA","category":"Undergraduate","progcode":"UGLA","shortdesc":"Specialize in Spanish language and culture by earning your bachelor’s degree in Spanish at ASU Online with highly-qualified and specially-trained instructors. The flexible and socioculturally diverse undergraduate degree program emphasizes Spanish language skills and the complex cultural panorama of the many worldwide societies in which Spanish is spoken."},{"title":"Curriculum and Instruction: English as a Second Language (MA)","code":"GRTE-EDESLMA","category":"Graduate","progcode":"GRTE","shortdesc":"ASU's Master of Arts in curriculum and instruction: English as a second language (ESL) prepares you to teach English language learners in a variety of settings, including U.S. schools. This program caters to professionals with a wide range of roles, including both new and experienced teachers, administrators, policymakers and community workers."},{"title":"English (MA)","code":"GRLA-LAENGLMA","category":"Graduate","progcode":"GRLA","shortdesc":"The online Master of Arts in English program at ASU combines courses from across the English discipline to provide you with strong writing, communication and critical thinking skills."},{"title":"Teaching English to Speakers of Other Languages (MTESOL)","code":"GRLA-LAENGMTESL","category":"Graduate","progcode":"GRLA","shortdesc":"The master's degree program in Teaching English to Speakers of Other Languages (TESOL) is for individuals who wish to build a career in the international field of English language teaching."},{"title":"English as a Second Language (Graduate Certificate)","code":"GRTE-TEESLGRCT","category":"Certificates","progcode":"GRTE","shortdesc":"ASU‘s online graduate certificate in English as a Second Language (ESL) prepares you to teach English language learners in a variety of settings, including U.S. schools."}],"Geographical Sciences & Urban Planning":[{"title":"Geographic Information Science (BS)","code":"UGLA-LAGISBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online B.S. in Geographic Information Science is a unique STEM-based social science degree. Students will learn practical skills in GIS software, statistics, and computer programming within the context of real world applications. This online program is ideal for students interested in gaining marketable skills that allow them to address complex environmental and societal issues."},{"title":"Geography (BA)","code":"UGLA-LAGCUBA","category":"Undergraduate","progcode":"UGLA","shortdesc":"The BA in geography at ASU gives you a unique perspective of the modern world, from local to global, through the lens of space and place."},{"title":"Geography (BS)","code":"UGLA-LAGCUBS","category":"Undergraduate","progcode":"UGLA","shortdesc":"The BS in Geography program at ASU provides you with a distinctive perspective of the modern world through the lens of its natural elements."},{"title":"Urban Planning (BSP)","code":"UGLA-ARPUPBSP","category":"Undergraduate","progcode":"UGLA","shortdesc":"The online Bachelor of Science in Urban Planning degree at Arizona State University introduces you to the broader purpose of planning, while focusing on practice and application. The program offers expertise in the analysis and synthesis of the social, physical, economic and political factors that affect urban and regional development."}],"Social Work & Behavioral Health":[{"title":"Behavioral Health (Clinical) (DBH)","code":"GRNH-NHBVHCDBH","category":"Graduate","progcode":"GRNH","shortdesc":"The Doctor of Behavioral Health program offered through the College of Health Solutions prepares you, as master’s–level clinicians, for the newly transformed medical care marketplace, one in which evidence–based, cost–effective behavioral interventions replace treatment that results in undercare, overcare, or misuse."},{"title":"Behavioral Health (Management) (DBH)","code":"GRNH-NHBVHMDBH","category":"Graduate","progcode":"GRNH","shortdesc":"The Doctor of Behavioral Health program with an emphasis in management through the College of Health Solutions, prepares current and future healthcare managers for the newly transformed medical care marketplace, one in which evidence–based, cost–effective behavioral interventions replace treatment that results in undercare, overcare, or misuse."},{"title":"Curriculum and Instruction: Autism Spectrum Disorders (MEd)","code":"GRTE-TEASDMED","category":"Graduate","progcode":"GRTE","shortdesc":"ASU's Master of Education in curriculum and instruction: autism spectrum disorders equips individuals with specialized skills and knowledge to work effectively and compassionately with children and adults affected with autism."},{"title":"Indigenous Education (MA)","code":"GRLA-LAIEDMA","category":"Graduate","progcode":"GRLA","shortdesc":"The online Indigenous Education MA degree program emphasizes research, theory, and practice related to both education and the process of schooling. This program engages individuals who are interested in or currently working with and in Indigenous communities or schools serving Indigenous children."},{"title":"Social Work (MSW)","code":"GRPP-PPSWDMSW","category":"Graduate","progcode":"GRPP","shortdesc":"The Master of Social Work (MSW) online program at Arizona State University will prepare you to work with individuals, families, communities, and in the world at large to promote social justice and find practical solutions to social problems and pressing issues facing the most vulnerable in our society."},{"title":"Special Education (Applied Behavior Analysis) (MA)","code":"GRTE-TESPEABAMA","category":"Graduate","progcode":"GRTE","shortdesc":"ASU Online's Master of Arts in Special Education with a concentration in Applied Behavior Analysis (ABA) pairs research and experience to prepare students to work professionally with individuals with special learning and behavior needs using the principles of applied behavior analysis."},{"title":"An Overview of Autism Spectrum Disorders (Graduate Certificate)","code":"GRTE-EDSPEGRCA","category":"Certificates","progcode":"GRTE","shortdesc":"ASU’s Graduate Certificate in autism spectrum disorders is ideal for educators, interventionists, psychologists, pathologists, behavior analysts, or family members who want to enhance their preparation for working with children and adults affected with autism spectrum disorders."},{"title":"Applied Behavior Analysis (Graduate Certificate)","code":"GRTE-TEABAGRCT","category":"Certificates","progcode":"GRTE","shortdesc":"ASU’s online Graduate Certificate in Applied Behavior Analysis pairs research and experience to prepare professionals to work with individuals with special learning and behavior needs. Courses enable students to focus on the population with whom they plan to work, as well as to gain knowledge and skills to use ABA across a variety of settings. "},{"title":"Integrated Behavioral Health - Clinical (Grad Certificate)","code":"GRNH-NHIBHCGRCT","category":"Certificates","progcode":"GRNH","shortdesc":"The online graduate certificate in Integrated Behavioral Health - Clinical is intended to provide master's level behavioral clinicians with skills necessary to successfully transition into the integrated primary care environment."},{"title":"Integrated Behavioral Health - Management (Grad Certificate)","code":"GRNH-NHIBHMGRCT","category":"Certificates","progcode":"GRNH","shortdesc":"Students of the online Integrated Behavioral Health - Management Graduate Certificate will receive training on effective management of integrated care systems. Explore new skills from mental health treatment, enhanced behavior change coaching, strategic planning on health outcome improvements and overall quality of care."}]}